In [65]:
import sys
import pandas as pd
from pandas import DataFrame
import matplotlib.pyplot as plt
%matplotlib inline

In [66]:
df_bikes = pd.read_csv("bike_1.csv")
df_weather = pd.read_csv("weather.csv")

In [67]:
df_bikes.head()

,STATION_NUMBER,TIME,STATUS,NUMBER_OF_BIKES,NUMBER_OF_STANDS,NUMBER_OF_SPACES
0,1,1522869876000,OPEN,0,31,31
1,1,1522869876000,OPEN,0,31,31
2,1,1522870667000,OPEN,0,31,31
3,1,1522870667000,OPEN,0,31,31
4,1,1522871276000,OPEN,0,31,31

In [68]:
df_weather.head()

   temperature   rain              time
0         8.04  0.005  14/03/2018 00:00
1         7.72  0.105  14/03/2018 03:00
2         7.65  0.260  14/03/2018 06:00
3         7.95  0.235  14/03/2018 09:00
4         8.10  0.475  14/03/2018 12:00

Since there is no foreign key in both tables, it had better to add two coulmn to make table combine together

For weather table, convent to timestamp

In [69]:
import time
pattern='%d/%m/%Y %H:%M'

In [70]:
#There are a little difference between tamp in weather and bike Since the bike time has accuacy in millseconds
TimestampWeather=[]
for index, row in df_weather.iterrows():
    TimestampWeather.append(int(time.mktime(time.strptime(row['time'],pattern))* 1000))

In [71]:
TimestampWeather[0:5]

[1520985600000, 1520996400000, 1521007200000, 1521018000000, 1521028800000]

In [72]:
df_weather["tamp"] = TimestampWeather

In [73]:
df_weather.head()

   temperature   rain              time           tamp
0         8.04  0.005  14/03/2018 00:00  1520985600000
1         7.72  0.105  14/03/2018 03:00  1520996400000
2         7.65  0.260  14/03/2018 06:00  1521007200000
3         7.95  0.235  14/03/2018 09:00  1521018000000
4         8.10  0.475  14/03/2018 12:00  1521028800000

Add a human readable time in bike table

In [76]:
time = []
import datetime
for index, row in df_bikes.iterrows():
    time.append(datetime.datetime.fromtimestamp(int(row["TIME"]/1000)).strftime('%d/%m/%Y %H:%M:%S'))
time[0:5]

'04/04/2018 20:24:36'

In [77]:
df_bikes["time"] = time

In [78]:
df_bikes.head()

,STATION_NUMBER,TIME,STATUS,NUMBER_OF_BIKES,NUMBER_OF_STANDS,NUMBER_OF_SPACES,time
0,1,1522869876000,OPEN,0,31,31,04/04/2018 20:24:36
1,1,1522869876000,OPEN,0,31,31,04/04/2018 20:24:36
2,1,1522870667000,OPEN,0,31,31,04/04/2018 20:37:47
3,1,1522870667000,OPEN,0,31,31,04/04/2018 20:37:47
4,1,1522871276000,OPEN,0,31,31,04/04/2018 20:47:56

In [79]:
df_weather.head()

   temperature   rain              time           tamp
0         8.04  0.005  14/03/2018 00:00  1520985600000
1         7.72  0.105  14/03/2018 03:00  1520996400000
2         7.65  0.260  14/03/2018 06:00  1521007200000
3         7.95  0.235  14/03/2018 09:00  1521018000000
4         8.10  0.475  14/03/2018 12:00  1521028800000

In [92]:
maxtime = int(DataFrame.max(df_bikes['TIME']))
maxtime

1523721176000

In [95]:
lasttime =[]
for i in range()
maxtime_lastweek = int(maxtime/1000 - 60 * 60 *24 *7)

In [116]:
bikechoose = df_bikes[(df_bikes.TIME <= int((maxtime_lastweek + 60*30)* 1000))&(df_bikes.TIME >= int((maxtime_lastweek- 60 *30)*1000)) ]

In [117]:
bikechoose

,STATION_NUMBER,TIME,STATUS,NUMBER_OF_BIKES,NUMBER_OF_STANDS,NUMBER_OF_SPACES,time
815,1,1523114673000,OPEN,31,31,0,07/04/2018 16:24:33
816,1,1523114795000,OPEN,31,31,0,07/04/2018 16:26:35
817,1,1523114795000,OPEN,31,31,0,07/04/2018 16:26:35
818,1,1523115405000,OPEN,31,31,0,07/04/2018 16:36:45
819,1,1523115405000,OPEN,31,31,0,07/04/2018 16:36:45
820,1,1523116014000,OPEN,31,31,0,07/04/2018 16:46:54
821,1,1523116332000,OPEN,31,31,0,07/04/2018 16:52:12
822,1,1523116624000,OPEN,31,31,0,07/04/2018 16:57:04
823,1,1523116960000,OPEN,31,31,0,07/04/2018 17:02:40
824,1,1523117322000,OPEN,30,31,1,07/04/2018 17:08:42
825,1,1523117542000,OPEN,30,31,1,07/04/2018 17:12:22
826,1,1523117889000,OPEN,30,31,1,07/04/2018 17:18:09

In [118]:
weatherchoose = df_weather[(df_weather.tamp <= ((maxtime_lastweek + 60*30)* 1000))&(df_weather.tamp >= ((maxtime_lastweek- 60 *30)*1000)) ]

In [119]:
weatherchoose

     temperature  rain              time           tamp
286         12.0   0.0  07/04/2018 16:30  1523115000000
287          9.0   0.0  07/04/2018 17:00  1523116800000

In [124]:
test_findClosest = [2,3,5,7]
myNumber = 4
min(test_findClosest, key = lambda x : abs(x-myNumber))

3

In [125]:
TimestampWeather[0:5]

[1520985600000, 1520996400000, 1521007200000, 1521018000000, 1521028800000]

In [146]:
import numpy as np
weather_tamp=[]
weather_rain=[]
weather_temperature = []
weather_time =[]
for index, row in df_bikes.iterrows():
    myNumber = row["TIME"]
    closestTime = min(TimestampWeather, key = lambda x : abs(x-myNumber))
    if(abs(myNumber-closestTime) > 60 * 60 * 1000):
        weather_time.append(np.nan)
        weather_rain.append(np.nan)
        weather_temperature.append(np.nan)
        weather_tamp.append(np.nan)
    else:
        weather_tamp.append(closestTime)
        weather_rain.append(df_weather.loc[df_weather['tamp'] == closestTime,'rain'].item())
        weather_temperature.append(df_weather.loc[df_weather['tamp'] == closestTime,'temperature'].item())
        weather_time.append(df_weather.loc[df_weather['tamp'] == closestTime,'time'].item())

In [147]:
df_x.:

temperature    object
rain           object
time           object
tamp           object
dtype: object

In [149]:
df_x

Empty DataFrame
Columns: [temperature, rain, time, tamp]
Index: []

In [140]:
weather_time.count(np.nan)

82

In [141]:
df_x.head()

Empty DataFrame
Columns: [temperature, rain, time, tamp]
Index: []

In [142]:
df_weather.loc[df_weather['tamp'] == 1522872000000]

     temperature  rain              time           tamp
175         5.62   0.0  04/04/2018 21:00  1522872000000

In [151]:
df_weather.loc[df_weather['tamp'] == 1522872000000].rain[0]

KeyError: 0